[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:66:24
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "Requester's email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests maxLength validation works for email field 1
statusReason: Error: Unable to find an element with the text: Max length 255 characters. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:86:24
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "Professor's email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests maxLength validation works for email field 2
statusReason: Error: Unable to find an element with the text: Max length 255 characters. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
