[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:12:31
 }) {
   //const addZ = (string) => `${string}Z`;
 
-  const objectToAxiosParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationrequest.requesterEmail,
-      professorEmail: recommendationrequest.professorEmail,
-      explanation: recommendationrequest.explanation,
-      dateRequested: recommendationrequest.dateRequested,
-      dateNeeded: recommendationrequest.dateNeeded,
-      done: recommendationrequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:25:48
     },
   });
 
-  const onSuccess = (recommendationrequest) => {
-    toast(
-      `New recommendation request Created - id: ${recommendationrequest.id} requesterEmail: ${recommendationrequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationrequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New recommendation request Created - id: 1 requesterEmail: cgaucho@ucsb.edu"

Number of calls: 0
