[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:48:13
       params: {
         id: recommendationrequests.id,
       },
-      data: {
-        requesterEmail: recommendationrequests.requesterEmail,
-        professorEmail: recommendationrequests.professorEmail,
-        explanation: recommendationrequests.explanation,
-        dateRequested: formatDate(recommendationrequests.dateRequested),
-        dateNeeded: formatDate(recommendationrequests.dateNeeded),
-        // Stryker disable next-line all : don't test
-        done:
-          recommendationrequests.done === "true" ||
-          recommendationrequests.done === true,
-      },
+      data: {},
     };
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"explanation\":\"PhD CS Stanford program\",\"dateRequested\":\"2022-04-20T00:00:00.000Z\",\"dateNeeded\":\"2022-05-01T00:00:00.000Z\",\"done\":true}"
Received: "{}"

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:56:11
         dateNeeded: formatDate(recommendationrequests.dateNeeded),
         // Stryker disable next-line all : don't test
         done:
-          recommendationrequests.done === "true" ||
-          recommendationrequests.done === true,
+          false,
       },
     };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"explanation\":\"PhD CS Stanford program\",\"dateRequested\":\"2022-04-20T00:00:00.000Z\",\"dateNeeded\":\"2022-05-01T00:00:00.000Z\",\"done\":true}"
Received: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"exp

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:56:11
         dateNeeded: formatDate(recommendationrequests.dateNeeded),
         // Stryker disable next-line all : don't test
         done:
-          recommendationrequests.done === "true" ||
+          false ||
           recommendationrequests.done === true,
       },
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"explanation\":\"PhD CS Stanford program\",\"dateRequested\":\"2022-04-20T00:00:00.000Z\",\"dateNeeded\":\"2022-05-01T00:00:00.000Z\",\"done\":true}"
Received: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"exp

[Survived] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:57:11
         // Stryker disable next-line all : don't test
         done:
           recommendationrequests.done === "true" ||
-          recommendationrequests.done === true,
+          false,
       },
     };

[Survived] BooleanLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:57:43
         // Stryker disable next-line all : don't test
         done:
           recommendationrequests.done === "true" ||
-          recommendationrequests.done === true,
+          recommendationrequests.done === false,
       },
     };

[Killed] LogicalOperator
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:89:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationrequests}
-          />
-        )}
+        {recommendationrequests || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationrequests} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, requesterEmail, professorEmail, explanation, dateRequested, dateNeeded, done}). If you meant to render a collection of children, use an array instead.
