[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:45:15
     return {
       url: "/api/recommendationrequests",
       method: "PUT",
-      params: {
-        id: recommendationrequests.id,
-      },
+      params: {},
       data: {
         requesterEmail: recommendationrequests.requesterEmail,
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:48:13
       params: {
         id: recommendationrequests.id,
       },
-      data: {
-        requesterEmail: recommendationrequests.requesterEmail,
-        professorEmail: recommendationrequests.professorEmail,
-        explanation: recommendationrequests.explanation,
-        dateRequested: formatDate(recommendationrequests.dateRequested),
-        dateNeeded: formatDate(recommendationrequests.dateNeeded),
-        // Stryker disable next-line all
-        done:
-          // Stryker disable next-line all
-          recommendationrequests.done === "true" ||
-          // Stryker disable next-line all
-          recommendationrequests.done === true,
-      },
+      data: {},
     };
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"cgaucho@ucsb.edu\",\"professorEmail\":\"phtcon@ucsb.edu\",\"explanation\":\"PhD CS Stanford program\",\"dateRequested\":\"2022-04-20T00:00:00.000Z\",\"dateNeeded\":\"2022-05-01T00:00:00.000Z\",\"done\":true}"
Received: "{}"

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:64:49
     };
   };
 
-  const onSuccess = (recommendationrequests) => {
-    toast(
-      `Recommendation Request Updated - id: ${recommendationrequests.id} requesterEmail: ${recommendationrequests.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationrequests) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:66:7
 
   const onSuccess = (recommendationrequests) => {
     toast(
-      `Recommendation Request Updated - id: ${recommendationrequests.id} requesterEmail: ${recommendationrequests.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17 requesterEmail: cgaucho@ucsb.edu"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:91:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationrequests}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:91:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationrequests}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
