[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:6:27
 import { useNavigate } from "react-router-dom";
 
 export function removeZ(myString) {
-  return myString.replace("Z", "");
+  return myString.replace("", "");
 }
 
killedBy: RecommendationRequestForm tests that the removeZ function works properly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABC"
Received: "ABCZ"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:66:23
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
-            required: "Requester's email is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requester's email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:131:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date requested is required."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:131:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested && "Date requested is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:148:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "Date needed is required."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:148:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded && "Date needed is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:158:32
           // data-testid={testIdPrefix + "-done"}
           id="done"
           isInvalid={Boolean(errors.done)}
-          {...register("done", {
-            required: "Done is required.",
-            // valueAsBoolean: true,
-          })}
+          {...register("done", {})}
         >
           <option value="">-- select --</option>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestForm.js:177:18
       </Button>
       <Button
         variant="Secondary"
-        onClick={() => navigate(-1)} // Likewise to navigate, it's the 'back' button
+        onClick={() => undefined} // Likewise to navigate, it's the 'back' button
         data-testid={testIdPrefix + "-cancel"}
       >
killedBy: RecommendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] UnaryOperator
main/components/RecommendationRequests/RecommendationRequestForm.js:177:33
       </Button>
       <Button
         variant="Secondary"
-        onClick={() => navigate(-1)} // Likewise to navigate, it's the 'back' button
+        onClick={() => navigate(+1)} // Likewise to navigate, it's the 'back' button
         data-testid={testIdPrefix + "-cancel"}
       >
killedBy: RecommendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:178:37
       <Button
         variant="Secondary"
         onClick={() => navigate(-1)} // Likewise to navigate, it's the 'back' button
-        data-testid={testIdPrefix + "-cancel"}
+        data-testid={testIdPrefix + ""}
       >
         Cancel
killedBy: RecommendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
