[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:44:15
     },
 
     {
-      Header: "Requester's Email",
+      Header: "",
       accessor: "requesterEmail",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requester's Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:49:17
     },
     {
       Header: "Professor's Email",
-      accessor: "professorEmail",
+      accessor: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
