[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequests",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/recommendationrequests"}
Received: undefined

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/recommendationrequests",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
