[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="ArticlesForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">ID</Form.Label>
+              <Form.Control data-testid="ArticlesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">ID</Form.Label>
-              <Form.Control
-                data-testid="ArticlesForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: ArticlesForm tests renders correctly when passing in an article
statusReason: Error: Unable to find an element by: [data-testid="/ArticlesForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:74:26
               isInvalid={Boolean(errors.url)}
               {...register("url", {
                 required: "URL is required.",
-                pattern: {
-                  value: url_regex,
-                  message: "Enter a valid URL.",
-                },
+                pattern: {},
               })}
             />
killedBy: ArticlesForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Enter a valid URL/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:76:28
                 required: "URL is required.",
                 pattern: {
                   value: url_regex,
-                  message: "Enter a valid URL.",
+                  message: "",
                 },
               })}
killedBy: ArticlesForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Enter a valid URL/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
