[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:9:43
 
 // Helper for DELETE request
 // Stryker disable StringLiteral : hard to test for string literals
-const cellToAxiosParamsDelete = (cell) => {
-  return {
-    url: "/api/articles",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-};
+const cellToAxiosParamsDelete = (cell) => {};
 // Stryker restore StringLiteral
 
killedBy: UserTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:31:34
   const navigate = useNavigate();
 
   // Stryker disable next-line StringLiteral : hard to test for string literals
-  const editCallback = (cell) => {
-    navigate(`/articles/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/articles/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:76:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    // Stryker disable next-line BlockStatement : hard to test for block statements
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:79:28
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     // Stryker disable next-line BlockStatement : hard to test for block statements
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
+      ButtonColumn("Edit", "", editCallback, "ArticlesTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:82:20
       ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"),
+      ButtonColumn("", "danger", deleteCallback, "ArticlesTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!
